pertemuan3/latihan/app/Http/Controllers/CategoryController.php

select * from "categories"
---
   public function index()
    {
        $categories = \App\Models\Category::all();