pertemuan3/latihan/app/Http/Controllers/DashboardPostController.php

select count(*) as aggregate from "posts" where "user_id" = 11 and "title" like '%phikmat9@gmail.com%'
---
    public function index()
    {
        $posts = Post::where('user_id', Auth::user()->id);
        if (request('search')) {
            $posts->where('title', 'like', '%' . request('search') . '%');
        }

        return view('dashboard.index', [
            'posts' => $posts->paginate(5)->withQueryString()
        ]);

select * from "categories"
---
    public function create()
    {
        return view('dashboard.create', [
            'categories' => Category::all()
        ]);