pertemuan3/latihan/app/Http/Controllers/PostController.php

   public function index()
   {
      $posts = Post::all();
---
select * from "posts"