pertemuan3/latihan/app/Http/Controllers/RegisterController.php

insert into "users" ("name", "username", "email", "password", "updated_at", "created_at") values ('user077', 'user077', 'user077@gmail.com', '$2y$12$4IZKvRlMzpqgVwsgJCUnq.jEG2dy37sWpVsJDHEz/UM9AOc34dxG2', '2025-12-17 08:18:48', '2025-12-17 08:18:48')
---
    public function register(Request $request)
    {
        $validated = $request->validate([
            'name' => 'required',
            'email' => 'required|email|unique:users',
            'password' => 'required|confirmed|min:5'
        ]);

        $validated['password'] = Hash::make($validated['password']);

        User::create($validated);