pertemuan3/latihan/routes/web.php

select * from "posts" order by "created_at" desc
---
Route::post('/logout', [LoginController::class, 'logout'])->name('logout');

// Dashboard Posts Routes
Route::get('/dashboard', [DashboardPostController::class, 'index'])->middleware(['auth','verified'])->name('dashboard.posts.index');